<details><summary>Digger run report at 2024-08-03 14:13:48 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # civo_firewall.core-firewall will be created
  + resource "civo_firewall" "core-firewall" {
      + create_default_rules = false
      + id                   = (known after apply)
      + name                 = "core"
      + network_id           = (known after apply)
      + region               = (known after apply)

      + egress_rule (known after apply)

      + ingress_rule {
          + action     = "allow"
          + cidr       = [
              + "0.0.0.0/8",
            ]
          + id         = (known after apply)
          + label      = "k8s"
          + port_range = "443"
          + protocol   = "tcp"
        }
      + ingress_rule {
          + action     = "allow"
          + cidr       = [
              + "0.0.0.0/8",
            ]
          + id         = (known after apply)
          + label      = "k8s"
          + port_range = "6443"
          + protocol   = "tcp"
        }
      + ingress_rule {
          + action     = "allow"
          + cidr       = [
              + "0.0.0.0/8",
            ]
          + id         = (known after apply)
          + label      = "k8s"
          + port_range = "80"
          + protocol   = "tcp"
        }
    }

  # civo_kubernetes_cluster.core-cluster will be created
  + resource "civo_kubernetes_cluster" "core-cluster" {
      + api_endpoint           = (known after apply)
      + applications           = "cert-manager"
      + cluster_type           = (known after apply)
      + cni                    = (known after apply)
      + created_at             = (known after apply)
      + dns_entry              = (known after apply)
      + firewall_id            = (known after apply)
      + id                     = (known after apply)
      + installed_applications = (known after apply)
      + kubeconfig             = (sensitive value)
      + kubernetes_version     = (known after apply)
      + master_ip              = (known after apply)
      + name                   = "core"
      + network_id             = (known after apply)
      + num_target_nodes       = (known after apply)
      + ready                  = (known after apply)
      + region                 = (known after apply)
      + status                 = (known after apply)
      + target_nodes_size      = (known after apply)

      + pools {
          + instance_names      = (known after apply)
          + label               = "front-end"
          + node_count          = 3
          + public_ip_node_pool = (known after apply)
          + size                = "g4s.kube.xsmall"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
civo_firewall.core-firewall: Creating...
civo_firewall.core-firewall: Creation complete after 5s [id=c610a8bd-8324-4491-ac88-0658160d50f3]
civo_kubernetes_cluster.core-cluster: Creating...
civo_kubernetes_cluster.core-cluster: Still creating... [10s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [20s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [30s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [40s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [50s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [1m0s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [1m10s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [1m20s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [1m30s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [1m40s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [1m50s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [2m0s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [2m10s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [2m20s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [2m30s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [2m40s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [2m50s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [3m0s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [3m10s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [3m20s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [3m30s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [3m40s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [3m50s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [4m0s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [4m10s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [4m20s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [4m30s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [4m40s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [4m50s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [5m0s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [5m10s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [5m20s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [5m30s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [5m40s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [5m50s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [6m0s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [6m10s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [6m20s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [6m30s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [6m40s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [6m50s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [7m0s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [7m10s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [7m20s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [7m30s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [7m40s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [7m50s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [8m0s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [8m10s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [8m20s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [8m30s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [8m40s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [8m50s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [9m0s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [9m10s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [9m20s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [9m30s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [9m40s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [9m50s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [10m0s elapsed]
civo_kubernetes_cluster.core-cluster: Creation complete after 10m8s [id=214b5d0c-89f5-4493-84f1-d48cc59133b2]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```
</details>
</details>